# total — бу умумий сумма дегани (русчада “общая сумма”).
total = 0
total += 5000   # биринчи машина
total += 8000   # иккинчи машина
print(total)    # натижа: 13000
# регистр бывает нижний и верхний , регистрозависимый это  харфлар катта кичиклигига сезгирц1
# анонимные функции номи йук функция дегани яни ушанда лямбда анононимные ва у бир каторга езиладиган тезкор функция хисобланади

# рассрочка бу бир нарсани олиб уни пулини ойма ойма ой тулаш усули масалан телефон компьютер

# комиссия бу кушимча тулов дегани демак банк уз хизмат хаккига пул олади, масалан ноутбукни 12 000 олсак банк комиссия 5% деса демак 12 000*5% купайтирсак 600 комиссияга олиб колади демак биз ашинда ноутбук учун 12600 тулашимиз керак


# логичиеские операторы тоже есть они: and or not in

# цикл это повторение
# while - пока кандайдир шарт булгунча кадар

#ctrl z оркага кайтаради энди олдига кайтариш учун эса ctrl y ни босамиз 

# генератор списков - list comperehension 
# модули в python: index oop rep etc. узимиз хохлагандай езиб .py ни кушиб куйсак булди